/**
 * CDN(Content Delivery Network);内容分发网络。依靠部署在边缘服务器，通过中心平台的负载均衡、内容分发、调度等功能
 * 是用户就近获取所需资源，降低网络拥塞，提高速度和命中率。SDN包括分布式存储、负载均衡、网络请求的重定向、内容管理，
 * 内容管理和全局的网络流量管理是CDN的核心。
 */

/**
 * 变量GC，垃圾回收机制
 * 标记清除法、引用计数法、标记复制法、标记整理法
 * 1、引用计数：每个对象增加一个计数器，记录当前对象的音乐数量，当引用计数归零时，改对象可以回收
 * 优点：a、内存释放及时 b、延迟低，内存释放的时机在各个时间段
 * 缺点：a、每个对象需要附加一个计数字段的空间 b、无法处理循环引用 c、引用复制；引用销毁修改计数字段时
，设计的操作可能比较昂贵
 */



 /**
  * 腾讯面试题：
  * 前端知识

dom树节点和渲染树节点一一对应吗，有什么是dom树会有，渲染树不会有的节点
CSS会阻塞dom解析吗？
requestIdleCallback是干什么用的
浏览器的渲染原理
浏览器的渲染过程
关键渲染路径详述
避免回流的方式
跨域的方式
前端的网络安全如何防御（xss，csrf）
cookies的保护方式
浏览器的缓存机制
什么文件用强缓存，什么文件用协商缓存
React-Native的原理，优缺点
react的虚拟dom和diff描述
react渲染优化（class，hook）
react的context的使用场景
node和后端知识

mysql和mongo的区别，使用情景
node有什么情况会导致内存溢出
node的内存分配
event loop（浏览器和node）
开放性题目

首屏优化方案
在App中如何实现前端资源离线缓存（方案）
算法

const arr = [101,19,12,51,32,7,103,8];

1.找出连续最大升序的数量

2.找出不连续最大升序的数量

---------------------------------------------------

浏览器的输入url后的过程
js异步方式
promise.resolve是干嘛的
promise.then如何实现链式调用
promise.then不返还一个promise还能用then吗
promise.finally的作用，如何自己实现finally
promise原理
webpack的异步加载如何实现
webpack的分包策略
跨域方式有什么
jsonp的原理
csrf防御手段
cookie的samesite属性作用
js对象循环引用会导致什么问题
react如何阻止原生默认事件
react的fiber节点树是什么数据结构，为什么要用这样的数据结构
react 异步渲染原理，优先级如何划分
react hook有自己做一些自定义的hook吗
react key的原理
react如何实现函数式调用组件，toast.show()
react新增了什么生命周和删除了什么生命周期，为什么要删除
node后端知识

node对于option请求如何处理
node如何处理cors跨域
ES modules和commonjs的区别
node的event loop和浏览器的区别
dns查询过程，dns用什么协议发起dns查询的
tcp和udp区别
tcp的三次握手和四次挥手
协商缓存和强缓存的区别
https协议握手大概过程
对称加密和非对称加密的区别
非对称加密，私钥和公钥的区别
https证书的作用
其他

如何埋点，为什么用1*1像素的gif图片做上报
如何定义首屏
------------------------------------------------------
前端知识

绑定事件有多少种方式
事件触发的流程，捕获和冒泡
捕获阶段能终止吗
终止冒泡阶段有哪些
如果实现one绑定事件
事件委托的原理
event.target和event.currtager的区别
浏览器显示一个图片有什么方式
如何获取url中的?后的参数
浏览器的内存回收机制 标记清除还是引用计数？
如何解决跨域
什么是简单请求什么复杂请求
const和let有什么区别
ES6常用的api有哪些
数组断引用的方式有什么
Base64图片有什么问题
node后端知识

Http强缓存和协商缓存用的是什么字段，整体流程是怎样
Https原理
Https第一次请求会携带什么
Ca证书的内容是什么
Https2.0的特性
xss攻击原理的防御方式
Csrf攻击原理和防御方式
二进制分帧的具体是什么
Keep alive和多路复用的区别
Option请求的作用
Node gc方式
新生代和老生代的区别
新生代内存地址移动到老生代内存地址的过程
开放问题

长列表优化方案
首屏优化方案
Node如何保证第三方接口的稳定性



  */
 